In [1]:
import pandas as pd
import numpy as np
import random

Q1. 리스트, 배열, 사전 형태의 데이터를 DataFrame으로 변환
- 5행 5열
- 가급적 의미있는 data
- 리스트 - 빙고 (25)
- 배열 - 점수
- 사전 - 탑승객

Q1.Type LIST

    리스트 형태의 데이터를 DF으로 변경
    리스트 형태의 데이터를 DF으로 변경하려면 리스트가 한 개 이상일 때 가능함. 한 리스트로만 만들 순 없음 (series 가능)

In [2]:
# Step 1
# 한 개의 리스트일때 list값은 Value가 됨.
random.seed(1)
Status = ['Alive','Dead','Injured','Diseases','Addicted']
Age = np.random.randint(1,100,size=5).tolist()
Gender = np.random.randint(2,size=5).tolist()
Job = np.random.randint(5,size=5).tolist()
Location = np.random.randint(0,9,size=5).tolist()

# Value가 된 list들은 Series로 변경.(name='column name')
Status = pd.Series(Status,name='Status')
Age = pd.Series(Age,name='Age')
Gender = pd.Series(Gender,name='Gender')
Job = pd.Series(Job,name='Job')
Location = pd.Series(Location,name='Location')

#변경된 Series는 concat으로 DataFrame형식을 가질 수 있음 (axis = 1 : column value로 지정) (index = [~])
List_DF = pd.concat([Status,Age,Gender,Job,Location],axis=1)
List_DF.rename(index={0:"A",1:"B",2:"C",3:"D",4:"E"})

#변경값 확인
List_DF['Gender'].replace({0:'male',1:'female'},inplace=True)

List_DF

     Status  Age  Gender  Job  Location
0     Alive    1  female    2         6
1      Dead   52    male    1         8
2   Injured    4  female    0         3
3  Diseases   20  female    0         5
4  Addicted   56    male    2         8

In [3]:
# step 2
# Series말고 바로 DF
random.seed(1)
Status = ['Alive','Dead','Injured','Diseases','Addicted']
Age = np.random.randint(1,100,size=5).tolist()
Gender = np.random.randint(2,size=5).tolist()
Job = np.random.randint(5,size=5).tolist()
Location = np.random.randint(0,9,size=5).tolist()

# 바로 DF
List_DF2 = pd.DataFrame([Status,Age,Gender,Job,Location])
List_DF2

#이상태는 col,row 가 뒤 바뀌어있는 상태 --> transpose 적용(전치)
List_DF2 = List_DF2.transpose()
List_DF2

#위와 마찬가지로 Col, Row 이름 적용 .rename
List_DF2.rename(index={0:"A",1:"B",2:"C",3:"D",4:"E"},columns={0:'Status',1:'Age',2:'Gender',3:'Job',4:'Location'},inplace=True)
List_DF2['Gender'].replace({0:'male',1:'female'},inplace=True)
List_DF2

     Status Age  Gender Job Location
A     Alive  61    male   4        5
B      Dead  25    male   3        8
C   Injured  99  female   3        8
D  Diseases  91  female   1        3
E  Addicted   5  female   2        7

List -> Array -> DF

In [7]:
#List 적용
random.seed(1)
Status = ['Alive','Dead','Injured','Diseases','Addicted']
Age = np.random.randint(1,100,size=5).tolist()
Gender = np.random.randint(2,size=5).tolist()
Job = np.random.randint(5,size=5).tolist()
Location = np.random.randint(0,9,size=5).tolist()

#Array 배열로 변환
Array_data = np.asarray([Status,Age,Gender,Job,Location])

#DF로 변환
Array_DF1 = pd.DataFrame(Array_data)
Array_DF1

#전치
Array_DF1 = Array_DF1.transpose()
Array_DF1

#위와 마찬가지로 Col, Row 이름 적용 .rename
Array_DF1.rename(index={0:"A",1:"B",2:"C",3:"D",4:"E"},columns={0:'Status',1:'Age',2:'Gender',3:'Job',4:'Location'},inplace=True)
Array_DF1

     Status Age Gender Job Location
A     Alive  56      0   1        1
B      Dead  31      0   3        4
C   Injured  11      0   1        7
D  Diseases  61      0   2        7
E  Addicted  15      1   1        7

Q2. Type Array
    
    Array(배열)은 Value값으로 바로 지정이 되기 때문에, Col/row 이름만 지정해주면 바로 가능.

In [11]:
Array_data = np.random.randint(1,100,size=(5,5))
Array_DF = pd.DataFrame(Array_data)
Array_DF.rename(columns ={0:"V1",1:"V2",2:"V3",3:"V4",4:"V5"},index={0:"H1",1:"H2",2:"H3",3:"H4",4:"H5"},inplace=True)
Array_DF

    V1  V2  V3  V4  V5
H1  87  34   7  36  96
H2  74  34  62  21  95
H3  75  59  67  37  87
H4  21  53  84  65  33
H5  22  12  74   4  11

Q3. Type DICT

    사전형 데이터는 {키:값} 형태를 갖는데 이것은 DF 에선 {열:행} 값을 갖는다. 1열 2행이라면 {열:[1행값,2행값]} 
    Column은 열의 이름으로 자동변환. row index는 직접 변환해야함.

In [17]:
Dict_data = {'Type':[1,3,1,5,2],'Age':[10,20,66,24,30],'Gender':[1,0,0,1,1],'Fee':[1000,6000,2500,3000,5500],'Collect':[0,0,1,0,1]}
Dict_DF = pd.DataFrame(Dict_data)
Dict_DF.rename(index={0:"A",1:"B",2:"C",3:"D",4:"E"},inplace=True)
Dict_DF['Gender'].replace({0:'male',1:'female'},inplace=True)
Dict_DF

   Type  Age  Gender   Fee  Collect
A     1   10  female  1000        0
B     3   20    male  6000        0
C     1   66    male  2500        1
D     5   24  female  3000        0
E     2   30  female  5500        1

Q2. 위에서 변환한 데이터 프레임에서 데이터 변경, 삭제, 전치, 인덱스 등 처리를 한 후 
    다시 리스트, 배열, 사전 형태로 변환하여 출력하세요

    삭제 ㅜ

In [21]:
List_DF.drop('Location',axis=1)
Array_DF.drop('H5')
Dict_DF.drop(index='E',columns='Collect')

   Type  Age  Gender   Fee
A     1   10  female  1000
B     3   20    male  6000
C     1   66    male  2500
D     5   24  female  3000

Q3. 위 과제로 변환한 데이터프레임을 csv, excel , json, pickle 파일로 저장하고 다시 읽어와서 출력하셈

In [26]:
List_DF.to_csv('../Data/List_DF.csv',index=False)
pd.read_csv('../Data/List_DF.csv')

     Status  Age  Gender  Job  Location
0     Alive    1  female    2         6
1      Dead   52    male    1         8
2   Injured    4  female    0         3
3  Diseases   20  female    0         5
4  Addicted   56    male    2         8

In [29]:
Array_DF.to_excel('../Data/Array_DF.xlsx',index=False)
pd.read_excel('../Data/Array_DF.xlsx')

   V1  V2  V3  V4  V5
0  87  34   7  36  96
1  74  34  62  21  95
2  75  59  67  37  87
3  21  53  84  65  33
4  22  12  74   4  11

In [30]:
Dict_DF.to_pickle('../Data/Dict_DF.pkl')
pd.read_pickle('../Data/Dict_DF.pkl')

   Type  Age  Gender   Fee  Collect
A     1   10  female  1000        0
B     3   20    male  6000        0
C     1   66    male  2500        1
D     5   24  female  3000        0
E     2   30  female  5500        1

In [31]:
Dict_DF.to_json('../Data/Dict_DF.json')
pd.read_json('../Data/Dict_DF.json')

   Type  Age  Gender   Fee  Collect
A     1   10  female  1000        0
B     3   20    male  6000        0
C     1   66    male  2500        1
D     5   24  female  3000        0
E     2   30  female  5500        1